<template>
	<div class="container">
		<h2>RegExp</h2>	
		<div class="task">
			<button v-on:click="testRegExp">testRegExp</button>
		</div>
		<div class="allText" id="unFormatText">
			
			+550
			Поколения работают на работах, которые ненавидят, чтобы покупать вещи, которые им не нужны

			+620
			«Только потеряв все, мы становимся свободными, чтобы сделать все что угодно.»

			+607
			Все, кого ты любил, или бросят тебя или умрут.

			+393
			Если можно проснуться в другом месте.

			Если можно проснуться в другое время.

			Почему бы однажды не проснуться другим человеком?

			+281
			Купи себе диван, и на два года ты полностью удовлетворен, не важно, что что-то идет не так, по крайней мере, ты решил вопрос с диваном.

			+274
			Возможно, самосовершенствование - это ещё не всё. Возможно, саморазрушение гораздо важнее.

			+179
			Заводишь друга, друг жениться, и у тебя больше нет друга.

			+163
			Стоит только поднять голову, посмотреть на звезды - и ты пропал.

			+147
			Бессонница делает все вокруг очень далеким: копией, снятой с копии, которая, в свою очередь, снята с копии.

			+134
			Вещи, которыми ты владеешь, в конце концов овладевают тобой.

			+134
			Если люди думают, что ты скоро умрешь, они начинают внимательно слушать тебя.

			...

			Если люди полагают, что видят тебя в последний раз, они начинают действительно смотреть на тебя. Иначе они говорят с тобой о своих проблемах с банком, о песне, которая играет по радио, или поправляют прическу, пока ты говоришь.

			А тут тебе принадлежит все их внимание.

			Они начинают слушать, а до того просто ждали своей очереди заговорить.

			+106
			Мы не хотим знать практически ничего про тех, кого любим.

			+92
			-Если ты не знаешь, чего хочешь,... ты в итоге останешься с тем, чего точно не хочешь.- Долговременная вероятность выживания каждого из нас равна нулю.

			+90
			Никто из вас не отличается красотой и уникальностью снежинки.

			+84
			Все, кого ты любил, или бросят тебя или умрут.

			Все, что ты создал, будет забыто.

			Все, чем ты гордился, будет со временем выброшено на помойку.

			+82
			— Я окончил колледж, звоню по междугороднему и говорю: «Пап, я окончил колледж.». Он говорит: «Найди работу.». В двадцать пять я ему звоню снова и говорю: «Теперь что?». Он говорит: «Не знаю, женись.».

			+80
			Мы не особенные.

			Но мы не дерьмо и не мусор.

			Мы просто есть.

			Мы просто есть, и то, что случается, — просто случается.

			+77
			Она боится заняться не тем, чем следует, и поэтому предпочитает не заниматься ничем.

			+70
			Мы были на волосок от жизни!

			+68
			в этом мире нет ничего вечного.всё потихоньку рассыпается.

			+64
			Женись, прежде чем секс тебе надоест, иначе вообще никогда не женишься.

			+61
			Когда то мы зачитывались порнографией — теперь каталогами Икеа.

			+60
			Встреча с тобой - кошмар моей жизни

			+57
			Чудесное волшебство смерти, одна секунда — ты ходишь и говоришь, и в следующую секунду ты — предмет

			+52
			Приходится попотеть, чтобы достичь совершенства, но минутное совершенство оправдывает все усилия. От совершенства и требовать нельзя, чтобы оно длилось дольше.

			+50
			Поколения за поколениями люди работают на ненавистных работах только для того, чтобы иметь возможность купить то, что им не нужно.

			+48
			Я никак не могу понять, почему это люди с такой легкостью выбрасывают то, от чего были без ума буквально ночь назад.

			+47
			*Если знаешь, где искать, то найдешь скелет в любом шкафу.*

			+42
			Презерватив - хрустальная туфелька нашего века. Одеваешь его при встречи с прекрасным принцем, танцуешь всю ночь, а потом выбрасываешь. Презерватив, не принца.
		</div>
	</div>
</template>
<script>
	export default	{
		name: 'regexpz',
		methods: {
			testRegExp: function() {
				var unFormatText = document.getElementById("unFormatText");
				var inRegExp = /\+[0-9]+/g;
				var outRegExp = '</p><p class="textParagraph">';
				var buffer  = unFormatText.textContent.replace(inRegExp, outRegExp);
				var alreadyFormated = buffer;
				document.getElementById("unFormatText").innerHTML = alreadyFormated;
				console.log(alreadyFormated);
			},
		}

	}
</script>
<style scoped>
	.textParagraph {
		margin-bottom: 5px;
		border-bottom: 1px solid teal;
		background: rgba(0,0,0,.2);
		text-indent: 30px
	}
	.blad {
		background: teal;
	}
</style>