<template>
  <section class="container">
    <div>
      <br>
      <br>
      <h4>ARRAY</h4>
      <p class="lead">В разделе Array законспектированы основные методы массивов. Методы предоставлены в виде кнопки "название метода", поля вывода функии-примера метода, блока отображабющего текст фукнции-примера, кнопки отображающей/скрывающей описание метода ("show description"), кнопки отображающей/скрывающей синтаксис данного метода ("show syntax").</p>
      <p class="lead"> По кнопке с именем метода выполняется функция-пример, результат отображается в поле справа от кнопки. При повторном нажатии -- выполняется вторая функция-пример, если такая присутствует в json. </p>
      <p class="lead">Данные брались из документации Мозиллы. Для удобства конспектирования данных в json было создано некое подобие конвертора: в поле textarea вставляется функция, по нажатию кнопки в том же поле выводится функция в виде json-строки (метод JSON.stringify). К полученному результату добавляется <span class="text-muted">document.getElementById(' имя в json'e ').textContent = "результат выполнения функции"</span> и результат копируется в json-файл. По нажатию кнопки "название метода" данная функция-строка выполнялется через  метод eval()</p>
      	
    </div>
  </section>
</template>

<script>
export default {
	components: {
    'navigate': () => import('@/components/navigate')
	}

}
</script>
<style lang="sass">
@import "@/assets/mainStyle.sass"
h2
  color: #2D1DA5


</style>

